{
	"report": "Reports are the centerpiece of the Squerly architecture. Reports gather data from a data source such as a file, database, or URI and allow you to query, sort, and aggregate the data and then present the data in tabular or graphical form to end users. Using simple templates, you can allow users to input variable data into the reports (See the documentation for more details.)",
	"name": "Enter a name for the report here <i>(255 chars max)</i>; this will be the name presented to end-users of the report",
	"data_source_id": "References the source data (file, database, stream, etc.) for this report",
	"query": "This field holds the query used to limit and filter the data from the data source. The query language is determined by the 'type' field. For database reports, this field should be a SQL 'SELECT' statement. For other report types, please consult the documentation. Template tags in the format: <b>{[example]}</b> can be used as input placeholders in this field.",
	"postprocess_code": "This field holds PHP code to post-process the report results (filtering data, adding columns, performing aggregations, etc.) The variable '<b>$results</b>' contains a 2D associative array of the report results. The code in this field should return a 2D associative array to be valid.",
	"hidden_from_ui": "If this field is set to Yes then this report will not show up in non-admin UI pages.",
	"admin_only": "If set to Yes, this report is only available to be run by administrators.",
	"default_refresh_time_in_seconds": "When this field is set to a number greater than zero, the report results screen will automatically refresh after the specified number of seconds (Set as appropriate in conjunction with the 'Default Cache Time' field.)",
	"default_cache_time_in_seconds": "Determines how many seconds that the results of the report will be cached (for a given set of inputs.) If this field is not set, the default cache setting defined in the config file will apply.",
	"form_submit_method": "Possible values: GET or POST; defaults to POST. Reports using GET inputs can have their results page be bookmarked and shared. POST is recommended for reports that use a lot of resources or take a long time to run."
}